todos_rails/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["body", "test"], ["done", true], ["created_at", "2021-03-08 19:23:05.590865"], ["updated_at", "2021-03-08 19:23:05.590865"]]
---
    def create
        @todo = Todo.new(todo_params)
        if @todo.save